Please nest the folding (`<details>`) blocks to give a top-level one like @syphernl suggest but include everything you know in the summary.

1. The project summary as suggested
2. The summarized total of all projects (add, change, destroy):

Here's the most exaggerated (but still very useful) target ... maybe a compromise is in order.

Could we perhaps even template this so operators can choose a layout that suits them?

This would help immensely as we sometimes have 50-100 plans in case some central lib or module changed.

**Overview**
<details><summary>Ran Plan for 9 projects<table><tr><th>:wrench:</th><th>:heavy_check_mark:</th><th>:bomb:</th><th>:lock:</th></tr><tr><td>3</td><td>4</td><td>1</td><td>1</td></tr></table>

</summary>

1. dir: `terraform/infra/foo-infra/buildfarm` workspace: `default`
1. dir: `terraform/infra/foo-infra/prod` workspace: `default`
1. dir: `terraform/infra/foo-infra/corp-stuff` workspace: `default`
1. dir: `terraform/infra/foo-infra/int/test-things` workspace: `default`
1. dir: `terraform/infra/foo-infra/int/ecr-repositories` workspace: `default`
1. dir: `terraform/infra/foo-infra/int/tools-in-there` workspace: `default`
1. dir: `terraform/infra/foo-infra/prd/prod-2-widgets` workspace: `default`
1. dir: `terraform/infra/foo-infra/prd/prod-rest` workspace: `default`
1. dir: `terraform/infra/foo-infra/prd/toolshed` workspace: `default`

**Details**
<details><summary>59 to add, 24 to change, 18 to destroy.</summary>

---
### 3. dir: `terraform/infra/foo-infra/crp/foobars` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place

Terraform will perform the following actions:

Plan: 3 to add, 1 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/infra/foo-infra/prd/prodstuff`
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/infra/foo-infra/prd/prodstuff`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 3 to add, 1 to change, 0 to destroy.

---
### 8. dir: `terraform/infra/dice-infra/prd/prodfluff` workspace: `default`
<details><summary>Show Output</summary>
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place

Terraform will perform the following actions:

  # module.eks.module.efs_csi_irsa_role.aws_iam_policy.efs_csi[0] will be created
+ resource "aws_iam_policy" "efs_csi" {
+       arn         = (known after apply)
+       description = "Provides permissions to manage EFS volumes via the container storage interface driver"
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "AmazonEKS_EFS_CSI_Policy-"
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "elasticfilesystem:DescribeMountTargets",
+                           "elasticfilesystem:DescribeFileSystems",
```

</details>
</details>
</details>